[
    {
        "id": "rice",
        "name": "Rice",
        "category": "Grains",
        "description": "Ours is a name reckoned among the leading manufacturers of matchless quality rice grains. We’re a professional in escalating high volumes of producing nutritious & non-polished rice across the globe.",
        "image": "/images/products/rice.jpg",
        "icon": "grass"
    },
    {
        "id": "wheat",
        "name": "Wheat",
        "category": "Grains",
        "description": "Being a respected exporter of wheat in the global agro-food products market, we abide by all international standards. Clients obtain superior quality wheat sourced from the best fields.",
        "image": "/images/products/wheat.jpg",
        "icon": "grain"
    },
    {
        "id": "tuna",
        "name": "Tuna",
        "category": "Marine",
        "description": "The factory primary's product is Canned Tuna, packaged in three different weight classifications in easy open ends tin cans of 100 grams, 160 grams, and bulk options.",
        "image": "/images/products/tuna.jpg",
        "icon": "sailing"
    },
    {
        "id": "sugar",
        "name": "Sugar",
        "category": "Commodities",
        "description": "Engaged in merchanting, wholesale distribution, and branded retail. Our strength in sourcing sugar lies in our relationship with top-tier producers and refined logistical networks.",
        "image": "/images/products/sugar.jpg",
        "icon": "cookie"
    },
    {
        "id": "veg-oil",
        "name": "Vegetable Oil",
        "category": "Commodities",
        "description": "The company exports vegetable cooking oil, 100% refined, in retail (PET bottles) and Jerry Cans under private labeling. Over the past years, we have attained global excellence.",
        "image": "/images/products/veg-oil.jpg",
        "icon": "water_drop"
    },
    {
        "id": "specialty",
        "name": "Specialty Crops",
        "category": "Grains",
        "description": "We have been steering the export of various pulses and specialty crops, especially in the Middle East and Africa, satisfying the high consumption demands of these regions.",
        "image": "/images/products/specialty.jpg",
        "icon": "nutrition"
    }
]